---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.LuminousFlux
source: html/52194ea4-2f46-dae9-a8a1-cdf8c8cfc345.htm
---
# Autodesk.Revit.DB.SpecTypeId.LuminousFlux Property

Luminous Flux, in discipline Electrical.

## Syntax (C#)
```csharp
public static ForgeTypeId LuminousFlux { get; }
```